---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SlantedColumnTopCutStyle
source: html/73dfc3b1-7e48-d825-6675-9d6f64cbd2f4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SlantedColumnTopCutStyle Property

"Top Cut Style"

## Syntax (C#)
```csharp
public static ForgeTypeId SlantedColumnTopCutStyle { get; }
```